#include <iostream>
#include<cmath>

using namespace std;
int main()
{
	setlocale(LC_CTYPE, "ukr");
	int n, i, k, S = 0;
	cout << "Введіть n";
	cin >> n;
	cout << "Введіть k";
	cin >> k;
	for (i = 1; i <= n; i++) {
		k = k + i;
		S = S + k;
	}
	cout << "S= " << S;
}

//1. Барон Мюнхаузен, вийшовши на екологічно чисте полювання, зарядив свою рушницю 
//кісточками вишень.Після того як він вдало влучив поміж роги оленям, в яких влучило
//відповідно k1, k2, …, kn кісточок, у них на головах виросли чудові молоді вишеньки.Скільки
//саджанців зміг подарувати барон Мюнхаузен садівникам - дослідникам ?